Revit 2027 API
Parameter.AsElementId Method
Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AsElementId()
Public Function AsElementId As ElementId
public:
ElementId^ AsElementId()
member AsElementId : unit -> ElementId
Return Value
ElementId
The Autodesk::Revit::DB::ElementId^ contained in the parameter.
Remarks
The AsAutodesk::Revit::DB::ElementId^ method should only be used if the StorageType property returns that the internal contents of the parameter is an ElementId.
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace